{
  "thread_id": "aZim2hT0nNjcRYVG@cmpxchg.org",
  "subject": "Re: [LSF/MM/BPF TOPIC] Improving MGLRU",
  "url": "https://lore.kernel.org/all/aZim2hT0nNjcRYVG@cmpxchg.org/",
  "dates": {
    "2026-02-20": {
      "report_file": "2026-02-20_ollama_llama3.1-8b.html",
      "developer": "Johannes Weiner",
      "reviews": [
        {
          "author": "Johannes Weiner",
          "summary": "reviewer questioned the generality of Kairui's proposed solution for MGLRU, pointing out that it performs better with zswap but worse with disk swap, and suggested that a notion of backend speed is needed to balance anon and file reclaim",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "requested changes"
          ],
          "has_inline_review": false,
          "tags_given": [
            "Reviewed-by"
          ],
          "analysis_source": "llm",
          "raw_body": "Are you referring to refaults on the page cache side, or swapins?\n\nLast time we evaluated MGLRU on Meta workloads, we noticed that it\ntends to do better with zswap, but worse with disk swap. It seemed to\njust prefer reclaiming anon, period.\n\nFor the balancing between anon and file to work well in all\nsituations, it needs to have a notion of backend speed and factor in\nthe respective cost of misses on each side.",
          "reply_to": "Kairui Song",
          "message_date": "2026-02-20"
        },
        {
          "author": "Johannes Weiner",
          "summary": "Reviewer noted that MGLRU's special casing of anonymous pages could lead to poor performance in workloads with large anon sets, as it assumes every refaulting anon page is hot and would fall apart when locality is low.",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "requested changes"
          ],
          "has_inline_review": false,
          "tags_given": [],
          "analysis_source": "llm",
          "raw_body": "On the face of it, both of these sounds problematic to me. Why are\nanon pages special cased?\n\nThe cost of reclaiming a page is:\n\n    reuse frequency * cost of a miss\n\nThe *type* of the page is not all that meaningful for workload\nperformance. The wait time is qualitatively the same.\n\nIf you assume every refaulting anon is hot, it'll fall apart when the\nanon set is huge and has little locality.",
          "reply_to": "Kairui Song",
          "message_date": "2026-02-20"
        }
      ],
      "analysis_source": "llm-per-reviewer"
    },
    "2026-02-21": {
      "report_file": "2026-02-20_ollama_llama3.1-8b.html",
      "developer": "Johannes Weiner",
      "reviews": [
        {
          "author": "Kairui Song (author)",
          "summary": "Author acknowledged that MGLRU performs worse in some workloads without swap, specifically citing MongoDB as an example. They attributed this issue to the PID protection mechanism being too passive and the force protection in sort_folio being too aggressive. The author agreed that this is a fixable issue using their proposed approach, which they claim outperforms Active/Inactive LRU in all known cases.",
          "sentiment": "needs_work",
          "sentiment_signals": [],
          "has_inline_review": false,
          "tags_given": [],
          "analysis_source": "llm",
          "raw_body": "A bit more than that. When there is no swap, MGLRU still performs\nworse in some workloads like MongoDB. From what I've noticed that's\nbecause the PID protection is a bit too passive, and there is a force\nprotection in sort_folio which sometimes seems too aggressive.\nActive/Inactive LRU will just move a folio to head if it's accessed\ntwice while in RAM, but MGLRU won't do so, as result hotter file\nfolios are evicted equally as the colder one until the PID gets\ntriggered, or still gets protected even if it hasn't been used for a\nwhile. And by the time PID finally gets triggered, the workload might\nhas changed. This is fixable using the approach I mentioned though,\nand it seems to be better than the Active/Inactive in all our known\ncases after that, whether that is a good fix worth discussion.\n\nI also notice Ridong has a series to apply a \"heat\" based reclaim,\nwhich also looks interesting.",
          "reply_to": "Johannes Weiner",
          "message_date": "2026-02-21"
        },
        {
          "author": "Kairui Song (author)",
          "summary": "Author acknowledged a concern about MGLRU ignoring shadow distance for re-activation, but noted that it's not considered a problem by users and performance looks good. They proposed alternative approaches to restore the old behavior or further optimize it.",
          "sentiment": "neutral",
          "sentiment_signals": [
            "acknowledged a concern",
            "proposed alternative approaches"
          ],
          "has_inline_review": false,
          "tags_given": [],
          "analysis_source": "llm",
          "raw_body": "Sorry I didn't make it clear. For MGLRU currently it already ignored\nthe shadow distance for re-activation. And yeah, basically all anons\nare activated on fault, which turns out to be quite nice? None MGLRU\nusers considered that as a problem and in fact the performance looks\ngood.\n\nOf course we can restore the old behavior to test the folio\nagainst some distance (gen distance or eviction distance), or push it\nfurther to only keep the reference bit (not completely ignore the\nshadow, just only keep the reference bits, if the LFU + PID still\nworks well without the distance), and gain more performance and bits\nto use.\n\nBTW I tried to restore the refault distance behavior for both anon and\nfile folios sometime ago:\nhttps://lwn.net/Articles/945266/\n\nFor file folios it indeed looked better, anon folios seems unchanged.\nBut later tests showed that it doesn't apply to all cases, and I think\nsomething better can be used as suggested in this topic.",
          "reply_to": "Johannes Weiner",
          "message_date": "2026-02-21"
        }
      ],
      "analysis_source": "llm-per-reviewer"
    }
  }
}