{
  "thread_id": "CAKEwX=O4ishgvhhZ1ssgbDUQewFamkyFT-uCpEWecWfe8SzwGg@mail.gmail.com",
  "subject": "Re: [LSF/MM/BPF TOPIC] Swap status and roadmap discussion",
  "url": "https://lore.kernel.org/all/CAKEwX=O4ishgvhhZ1ssgbDUQewFamkyFT-uCpEWecWfe8SzwGg@mail.gmail.com/",
  "dates": {
    "2026-02-23": {
      "report_file": "2026-02-23_ollama_llama3.1-8b.html",
      "developer": "Nhat Pham",
      "reviews": [
        {
          "author": "Nhat Pham",
          "summary": "Reviewer Nhat Pham suggested that instead of limiting virtual swap space, we should set limits on the physical backend where necessary, as virtual swap space is not a scarce resource.\n\nReviewer Nhat Pham noted that swap space itself may not be fully 64-bit capable, questioning whether the effort to save a few bits is worth it, especially considering dynamic reverse mapping\n\nReviewer Nhat Pham noted that swapfile size should be user-decided for physical swapfiles due to limited disk space, and suggested making it extensible at runtime. For zswap, he argued that the size should also be dynamic.",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "limit",
            "physical backend",
            "questioning",
            "uncertainty",
            "type dependency",
            "runtime extensibility"
          ],
          "has_inline_review": false,
          "tags_given": [
            "Reviewed-by"
          ],
          "analysis_source": "llm",
          "raw_body": "I don't think we should put limit in virtual swap space per se, as we\nare not consuming a real, physical, scarce resource.\n\nWe should put limit on the physical backend itself, where appropriate (see [1])/\n\n---\n\nI think you can compact this a bit. Swap space itself is not fully 64\nbits right?\n\nJust not sure if the juice is worth the squeeze to save a couple of\nbits here and there, especially if the reverse mapping is already\ndynamic :)\n\n---\n\nThis is very type dependent.\n\nFor physical swapfile, it's consuming a limited physical resource\n(disk space), so it should be userspace decided. It would be nice to\nmake swapfile extensible at runtime tho :)\n\nFor zswap then I think it really should be dynamic. You can read my\narguments in my virtual swap cover letter (see section I of [1]).\n\n[1]: https://lore.kernel.org/linux-mm/20260208222652.328284-1-nphamcs@gmail.com/",
          "reply_to": "Kairui Song",
          "message_date": "2026-02-23"
        },
        {
          "author": "Yosry Ahmed",
          "summary": "Reviewer Yosry Ahmed questioned the need for a reverse mapping in the swap subsystem, suggesting that scanning the virtual swap space for entries belonging to the backend being swapped off could be an alternative approach for swapoff operations, which would still be more efficient than the current method of scanning page tables.",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "requested changes"
          ],
          "has_inline_review": false,
          "tags_given": [
            "Reviewed-by"
          ],
          "analysis_source": "llm",
          "raw_body": "I think we should actually revisit the need for a reverse mapping to\nbegin with. For swapoff, we can probably scan the virtual swap space\nlooking for entries that belong to the backend being swapped off. Not\nas efficient as a reverse map, but still better than the status quo of\nscanning page tables. I don't think optimizing for swapoff is worth\nthe consistent overhead.\n\nThe other use cases are probably cluster readahead and swapcache-only\nreclaim, and I think both of these can also be revisited.",
          "reply_to": "Nhat Pham",
          "message_date": "2026-02-23"
        },
        {
          "author": "Yosry Ahmed",
          "summary": "Reviewer Yosry Ahmed expressed concern that the current code includes a reverse map, which he believes is not justified by its use cases and suggested making it optional depending on whether features like migration and compaction are enabled.\n\nReviewer Yosry Ahmed suggested removing the reverse map for certain users, citing it as unnecessary\n\nReviewer Yosry Ahmed expressed skepticism about the proposed swap design, stating that its effectiveness should be measured by performance on a wide range of workloads, rather than theoretical benefits.",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "requested changes",
            "skepticism",
            "pragmatic"
          ],
          "has_inline_review": false,
          "tags_given": [
            "Reviewed-by"
          ],
          "analysis_source": "llm",
          "raw_body": "Yeah I am not against having a reverse map in general (regardless of\nwhat design we end up having), I just think it has to be justified.\nWith the current code, the use cases are not that important imo, so we\ncan potentially drop it.\n\nIf new features like migration and compaction require a reverse map,\nit can be tied to them, and depending on the use cases, we could even\nmake the reverse mapping optional depending on whether these features\nare enabled or not -- at least in theory.\n\n---\n\nYeah it's not necessarily related, I was just mentioning that these\nare the obvious current users of the reverse map, but I don't think we\nshould keep the reverse map for them.\n\n---\n\nIt kinda makes sense in theory, but ultimately it should be whatever\nmakes the numbers look good for the largest amount of workloads.",
          "reply_to": "Kairui Song",
          "message_date": "2026-02-23"
        }
      ],
      "analysis_source": "llm-per-reviewer"
    },
    "2026-02-24": {
      "report_file": "2026-02-23_ollama_llama3.1-8b.html",
      "developer": "Nhat Pham",
      "reviews": [
        {
          "author": "Kairui Song (author)",
          "summary": "Author acknowledged the reviewer's point about swapoff not being worth much effort, but emphasized that other features like migration and compaction are still valuable and could benefit from a proper reverse map.\n\nAuthor acknowledges that readahead and swap cache reclaim need reevaluation, specifically considering lazy swap cache for non-RAM swaps and proactive reclaim for RAM-based swaps.",
          "sentiment": "needs_work",
          "sentiment_signals": [
            "acknowledged",
            "emphasized",
            "acknowledges a fix is needed"
          ],
          "has_inline_review": false,
          "tags_given": [],
          "analysis_source": "llm",
          "raw_body": "Right, I don't really think swapoff is worth that much effort too. But\nthere are still ideas like migration and compaction, which could\nreally make use of a proper reverse map.\n\n---\n\nAgree, readahead and swap cache reclaim do need some revisit... Not\nrelated to the revert map idea though.\n\nI'm thinking if we can make the swap cache completely lazy and never\nreclaim it proactively for non-RAM swap. And for RAM based swap\n(zswap / ZRAM), do the opposite, always ensure swap cache is\nreclaimed after use.",
          "reply_to": "Yosry Ahmed",
          "message_date": "2026-02-24"
        }
      ],
      "analysis_source": "llm-per-reviewer"
    }
  }
}